Mintharah/SPI-Stm32-QNX/Stm32-SPI/src/motor_send.c
/*
 * motor_send.c  (instrumented + SET_CONFIG/ACK)
 * ----------------------------------------------------------------------------
 * STM32 send side. Implements motor_on_block_ready(): each block becomes a wire
 * frame [ frame_header | rows | CRC ] in a double buffer, shipped to the Pi as an
 * SPI2 slave (full-duplex DMA) with a data-ready GPIO handshake.
 *
 *   SPI2 slave:  PB12 NSS, PB13 SCK, PB14 MISO, PB15 MOSI  (AF5), mode 0, MSB-first
 *   data-ready:  PB0 (output, high = frame waiting)
 *   DMA1 Stream4 Ch0 = SPI2_TX, DMA1 Stream3 Ch0 = SPI2_RX (carries Pi -> STM cmds)
 *
 * SET_CONFIG / ACK protocol (Pi -> STM, ACK in next outbound frame header):
 *
 *   1. After every TxRxCplt, sniff the first 4 bytes of s_rx_dummy. If they
 *      look like MOTOR_CMD_MAGIC, copy MOTOR_CMD_FRAME_BYTES into a small
 *      pending buffer and set s_cmd_pending. CRC validation is deferred.
 *
 *   2. motor_on_block_ready first assembles & arms the CURRENT frame using
 *      the CURRENT config (so the in-flight transfer never sees a partial
 *      update). THEN it processes the pending command:
 *         - bad CRC / unknown cmd / unsupported schema / out-of-range value
 *           -> NACK bits latched, no apply.
 *         - duplicate cmd_seq (Pi re-sent because it missed the ACK)
 *           -> re-latch ACK, no re-apply.
 *         - valid SET_CONFIG -> apply now (synth + motor_send update their
 *           block_rows), latch ACK_OK + CONFIG_APPLIED for the NEXT frame.
 *
 *   3. assemble_frame stamps frame_header_t.flags with the latched ACK/NACK
 *      bits and writes the low 16 bits of the most recent cmd_seq into
 *      _reserved. CONFIG_APPLIED is a one-shot: cleared after one frame.
 *      Everything else is sticky until a new command arrives.
 * ----------------------------------------------------------------------------
 */
#include "stm32f4xx_hal.h"
#include <string.h>
#include "motor_wire.h"
#include "motor_source.h"     /* motor_on_block_ready() -- we implement it */
#include "motor_send.h"
#include "motor_acquire.h"    /* runtime reconfig of the real-sensor source */

extern void Error_Handler(void);

#ifndef MOTOR_DEFAULT_BLOCK_ROWS
#define MOTOR_DEFAULT_BLOCK_ROWS  200u
#endif

/* data-ready line */
#define DR_PORT            GPIOB
#define DR_PIN             GPIO_PIN_0

#ifndef MOTOR_DR_ASSERT_DELAY_CYCLES
#define MOTOR_DR_ASSERT_DELAY_CYCLES  1000u
#endif

/* ---- diagnostic counters (read by main.c) -------------------------------- */
volatile uint32_t g_obr        = 0;
volatile uint32_t g_arm_called = 0;
volatile uint32_t g_arm_ok     = 0;
volatile uint32_t g_arm_fail   = 0;
volatile uint32_t g_sent       = 0;
volatile uint32_t g_spi_err    = 0;
volatile uint32_t g_cmd_seen   = 0;   /* commands sniffed in rx (post-CRC TBD)  */
volatile uint32_t g_cmd_ok     = 0;   /* SET_CONFIG applied                     */
volatile uint32_t g_cmd_nack   = 0;   /* SET_CONFIG rejected                    */

/* ---- state --------------------------------------------------------------- */
static SPI_HandleTypeDef s_hspi2;
static DMA_HandleTypeDef s_hdma_tx;
static DMA_HandleTypeDef s_hdma_rx;

static uint16_t s_block_rows = MOTOR_DEFAULT_BLOCK_ROWS;
static uint16_t s_frame_len  = 0;
static uint32_t s_seq        = 0;

/* Cumulative ADC samples produced, the frame timebase.
 *
 * h->timestamp used to be HAL_GetTick()*1000 -- millisecond resolution on a
 * block whose real cadence is exactly 10.0 ms. Every block boundary then
 * snapped to a whole millisecond tick, so the row timestamps the Pi derives
 * (hdr->timestamp + i*50 us) jumped by 0..1 ms at each block edge even though
 * every sample was present -- visible as periodic "drops" in a time-axis plot
 * while every drop counter read 0. Samples are uniform, so the sample count
 * itself is the timebase: monotonic, continuous, and exact at the boundary. */
static uint64_t s_sample_idx = 0;

/* The Pi clocks MOTOR_MAX_FRAME_BYTES every transfer (worst-case sizing).
 * We size BOTH the tx frames and the rx buffer to MAX. Only the first
 * s_frame_len bytes are meaningful in tx; everything beyond is whatever
 * the buffer happened to contain (the Pi ignores it anyway, frame size
 * is in the header).                                                       */
#ifndef TX_POOL_DEPTH
#define TX_POOL_DEPTH 4u
#endif

/* Pending-frame pool. A single pending slot meant that the moment TWO blocks
 * landed inside one in-flight transfer -- i.e. whenever a Pi read ran a little
 * past the 10 ms block period -- the second block overwrote the first in the
 * pending buffer and the older block was silently dropped (s_skipped++), which
 * the Pi sees as a seq gap ("drops"). The pool keeps the whole backlog the
 * producer can accumulate while the Pi catches up, so a slow read costs a few
 * ms of latency, not a frame. A block is discarded only when ALL slots are
 * occupied (one in flight + TX_POOL_DEPTH-1 queued), i.e. ~40 ms of backlog at
 * the default 10 ms block cadence -- unreachable with the Pi's ~8.7 ms average
 * read cycle. 4 slots x 4828 B = 19.3 KB, well within the F401CC's 64 KB.    */
static _Alignas(8) uint8_t s_frame[TX_POOL_DEPTH][MOTOR_MAX_FRAME_BYTES];
static _Alignas(8) uint8_t s_rx_dummy[MOTOR_MAX_FRAME_BYTES];

static volatile int s_tx_idx = -1;   /* slot currently armed/in flight, or -1 */

/* Per-slot state + FIFO of slots that hold a complete, unsent frame. The queue
 * is drained one frame per SPI exchange in TxRxCplt; the producer appends in
 * motor_on_block_ready. FIFO order guarantees seq is monotonic on the wire. */
enum { SLOT_EMPTY = 0, SLOT_READY = 1, SLOT_TX = 2 };
static uint8_t s_slot_state[TX_POOL_DEPTH];
static int     s_ready_q[TX_POOL_DEPTH];
static int     s_ready_head = 0;
static int     s_ready_cnt  = 0;

static volatile uint32_t s_sent    = 0;
static volatile uint32_t s_skipped = 0;

/* One-shot latch: a produced block was dropped before it could be sent (pool
 * full, or arm_tx gave up). Such a block never consumed a seq, so the Pi's
 * seq check cannot see it -- this latch is the only witness. Surfaced as
 * MOTOR_FLAG_BLOCK_DROPPED on the next assembled frame. */
static volatile uint8_t s_block_dropped_pending = 0;

