Mintharah/SPI-Stm32-QNX/Stm32-SPI/src/motor_send.c
/* ---- command/ACK state --------------------------------------------------- */
static volatile uint8_t s_cmd_pending = 0;        /* set by TxRxCplt, cleared at block boundary */
static uint8_t s_pending_cmd[MOTOR_CMD_FRAME_BYTES];

static uint16_t s_latched_ack_flags    = 0;       /* MOTOR_FLAG_ACK_* / NACK_*  */
static uint16_t s_latched_cmd_seq      = 0;       /* low 16 bits of last cmd    */
static uint8_t  s_config_applied_latch = 0;       /* one-shot CONFIG_APPLIED    */
static uint16_t s_last_applied_seq     = 0xFFFFu; /* sentinel: nothing applied  */
static uint8_t  s_have_last_applied    = 0;

/* Currently-applied STM-tier config. Initialised in motor_send_init() to the
 * compile-time defaults so process_pending_cmd can diff the incoming payload
 * against it and skip HAL-touching set functions when nothing has changed. */
static config_payload_t s_active_config;

/* ---- CRC-32/MPEG-2 --------------------------------------------------------
 *
 * Two implementations of the same algorithm (init 0xFFFFFFFF, poly
 * 0x04C11DB7, MSB-first, no reflection, no final XOR):
 *
 *   MOTOR_CRC_HW (firmware build): the STM32F4 CRC peripheral computes
 *   exactly CRC-32/MPEG-2. Feeding it 32-bit words packed MSB-first is
 *   byte-identical to the table version -- both CRC-covered regions are
 *   multiples of 4 bytes (frame body = 24 + n_rows*24, command body =
 *   12 + 28), so there is no zero-padding tail to diverge. Using it moves
 *   the ~530 us of table-driven CRC traffic off the AHB bus, which is the
 *   boundary glitch: the CRC burst starves the ADC DMA and a conversion
 *   overruns, shifting the sampled phase by one period. See the comment on
 *   MOTOR_FLAG_SAMPLE_OVERRUN.
 *
 *   Host test build: the table version, cross-checked against a bit-serial
 *   model of the CRC unit in test_motor_send.c.                                   */
#if defined(MOTOR_CRC_HW)
static void crc32_init(void)
{
    __HAL_RCC_CRC_CLK_ENABLE();
    CRC->CR = CRC_CR_RESET;         /* DR := 0xFFFFFFFF (hardwired init) */
}

static uint32_t crc32_mpeg2(const uint8_t *d, size_t n)
{
    CRC->CR = CRC_CR_RESET;
    size_t i = 0;
    while (n - i >= 4u) {
        uint32_t w = ((uint32_t)d[i] << 24) | ((uint32_t)d[i + 1] << 16)
                   | ((uint32_t)d[i + 2] << 8) |  (uint32_t)d[i + 3];
        CRC->DR = w;
        i += 4u;
    }
    return CRC->DR;
}
#else
static uint32_t s_crc_table[256];

static void crc32_init(void)
{
    for (uint32_t i = 0; i < 256; ++i) {
        uint32_t c = i << 24;
        for (int j = 0; j < 8; ++j)
            c = (c & 0x80000000u) ? (c << 1) ^ 0x04C11DB7u : (c << 1);
        s_crc_table[i] = c;
    }
}

static uint32_t crc32_mpeg2(const uint8_t *d, size_t n)
{
    uint32_t crc = 0xFFFFFFFFu;
    for (size_t i = 0; i < n; ++i)
        crc = (crc << 8) ^ s_crc_table[((crc >> 24) ^ d[i]) & 0xFFu];
    return crc;
}
#endif

/* ---- frame assembly ------------------------------------------------------ */

/* Microseconds per sample. The Pi computes row timestamps as
 * hdr->timestamp + i * (1,000,000 / sample_rate_hz), so stamping each block at
 * its first sample makes the derived timestamps continuous across blocks.     */
static uint64_t sample_interval_us(void)
{
    uint32_t rate = s_active_config.sample_rate_hz;
    return (rate > 0u) ? (1000000ull / rate) : 50ull;
}

static void assemble_frame(uint8_t *buf, const motor_row_t *rows_in, uint16_t n_rows)
{
    uint32_t seq = s_seq++;

    frame_header_t *h = (frame_header_t *)buf;
    h->magic     = MOTOR_FRAME_MAGIC;
    h->seq       = seq;
    h->timestamp = s_sample_idx * sample_interval_us();
    s_sample_idx += n_rows;
    h->version   = MOTOR_CONTRACT_VERSION;
    h->n_rows    = n_rows;

    /* ACK bits: latched (sticky until next command) + CONFIG_APPLIED one-shot.
     * Plus the ADC-overrun latch: a conversion was lost to a DMA overrun since
     * the last frame, so this block's boundary rows may be phase-shifted. */
    uint16_t f = s_latched_ack_flags;
    if (s_config_applied_latch) {
        f |= MOTOR_FLAG_CONFIG_APPLIED;
        s_config_applied_latch = 0;
    }
    if (motor_acquire_take_overrun_flag())
        f |= MOTOR_FLAG_SAMPLE_OVERRUN;
    if (s_block_dropped_pending) {
        f |= MOTOR_FLAG_BLOCK_DROPPED;
        s_block_dropped_pending = 0;
    }
    h->flags     = f;
    h->_reserved = s_latched_cmd_seq;

    /* Rows are already fully composed by the producer (motor_acquire);
     * just copy them in.                                                    */
    motor_row_t *dst = (motor_row_t *)(buf + sizeof(frame_header_t));
    memcpy(dst, rows_in, (size_t)n_rows * sizeof(motor_row_t));

    size_t covered = sizeof(frame_header_t) + (size_t)n_rows * sizeof(motor_row_t);
    uint32_t crc = crc32_mpeg2(buf, covered);
    memcpy(buf + covered, &crc, sizeof crc);

    /* Zero the slack out to MAX. The Pi clocks MAX bytes per transfer (so its
     * command frame on tx can ride alongside any block size up to MAX), so we
     * must transmit MAX bytes too -- with everything past the real frame end
     * being deterministic zeros, not stale data from a previously-larger
     * frame. The Pi ignores the slack (frame size comes from h->n_rows). */
    size_t total = covered + sizeof crc;
    if (total < MOTOR_MAX_FRAME_BYTES)
        memset(buf + total, 0, MOTOR_MAX_FRAME_BYTES - total);
}

/* ---- forward declarations (defined after arm_tx but called from it on retry) */
static void spi_init(void);
static void dma_init(void);

/* ---- transmit ------------------------------------------------------------ */
static void spin_cycles(uint32_t n)
{
    volatile uint32_t i = n;
    while (i--) __NOP();
}

static void arm_tx(int idx)
{
    g_arm_called++;

    for (int attempt = 0; attempt < 50; attempt++) {
        if (attempt > 0) {
            HAL_SPI_DMAStop(&s_hspi2);

            uint32_t cs_wait = 50000u;
            while ((GPIOB->IDR & GPIO_PIN_12) == 0u && --cs_wait) {
                __NOP();
            }
        }

        /* Clear stale OVR/FRE on EVERY attempt. DMAStop (used instead of
         * the old HAL_SPI_DeInit/Abort path) does NOT clear these flags;
         * leaving them set causes the error interrupt to re-fire
         * immediately after ErrorCallback → arm_tx, locking the STM32 in
         * an infinite error loop. The old DeInit path toggled SPE which
         * cleared all flags as a side-effect, hiding this bug.           */
        if (s_hspi2.Instance->SR & SPI_SR_OVR) {
            volatile uint32_t tmp  = s_hspi2.Instance->DR;
            tmp = s_hspi2.Instance->SR;
            (void)tmp;
        }
        if (s_hspi2.Instance->SR & SPI_SR_FRE) {
            s_hspi2.Instance->CR1 &= ~SPI_CR1_SPE;
            s_hspi2.Instance->CR1 |=  SPI_CR1_SPE;
        }

