Mintharah/SPI-Stm32-QNX/Stm32-SPI/src/motor_send.c
        s_tx_idx = idx;

        if (HAL_SPI_TransmitReceive_DMA(&s_hspi2, s_frame[idx], s_rx_dummy,
                                        MOTOR_MAX_FRAME_BYTES) != HAL_OK) {
            s_tx_idx = -1;
            continue;
        }

        spin_cycles(MOTOR_DR_ASSERT_DELAY_CYCLES);

        uint32_t timeout = 5000u;
        while (HAL_SPI_GetState(&s_hspi2) != HAL_SPI_STATE_BUSY_TX_RX
               && --timeout) {
            __NOP();
        }
        if (timeout == 0u) {
            HAL_SPI_DMAStop(&s_hspi2);
            s_tx_idx = -1;
            continue;
        }

        g_arm_ok++;
        HAL_GPIO_WritePin(DR_PORT, DR_PIN, GPIO_PIN_SET);
        spin_cycles(50u);
        return;
    }

    s_skipped++;
    g_arm_fail++;
    s_block_dropped_pending = 1;
}

/* Dequeue the oldest queued block and arm it. If nothing is queued the link
 * stays idle. On an arm failure the slot's frame was never clocked, so the
 * slot is freed for reuse. Runs from motor_on_block_ready and TxRxCplt only,
 * both in the same NVIC priority class as the SPI/DMA ISRs.                */
static void arm_next_slot(void)
{
    if (s_ready_cnt <= 0) { s_tx_idx = -1; return; }

    int slot = s_ready_q[s_ready_head];
    s_ready_head = (s_ready_head + 1) % TX_POOL_DEPTH;
    s_ready_cnt--;

    arm_tx(slot);

    if (s_tx_idx == slot) {
        s_slot_state[slot] = SLOT_TX;
    } else {
        s_slot_state[slot] = SLOT_EMPTY;   /* failed to arm; slot is free */
    }
}

/* ---- command processing ------------------------------------------------- */
/* All of these run from motor_on_block_ready, which is itself called from
 * the TIM2 ISR (same NVIC priority as the SPI/DMA ISRs, so nothing here
 * preempts and the TX in flight can't be touched mid-DMA). */

static void process_pending_cmd(void)
{
    /* Snapshot the pending command into local space and clear the slot
     * before we do anything else: if TxRxCplt fires a fresh command in
     * the middle of validation (it can't preempt us, but defensive code
     * is cheap), it'll just set the flag again and we'll see it next
     * block.                                                              */
    uint8_t buf[MOTOR_CMD_FRAME_BYTES];
    memcpy(buf, s_pending_cmd, sizeof buf);
    s_cmd_pending = 0;

    const cmd_header_t *ch = (const cmd_header_t *)buf;

    /* Magic was already checked in the sniff, but re-check defensively. */
    if (ch->magic != MOTOR_CMD_MAGIC) return;

    /* CRC over [cmd_header_t][config_payload_t]. Checked BEFORE latching the
     * sequence number: cmd_seq comes out of the same frame the CRC is there to
     * vouch for, so latching first meant a corrupted frame could retarget the
     * ACK at a sequence number the Pi never sent, and the Pi matches ACKs by
     * exactly that field. A frame that fails its CRC tells us nothing at all,
     * including who it claims to be from. */
    size_t covered = sizeof(cmd_header_t) + sizeof(config_payload_t);
    uint32_t got;
    memcpy(&got, buf + covered, sizeof got);
    if (crc32_mpeg2(buf, covered) != got) {
        s_latched_ack_flags = MOTOR_FLAG_ACK_NACK | MOTOR_FLAG_NACK_CRC;
        g_cmd_nack++;
        return;
    }

    s_latched_cmd_seq = ch->cmd_seq;

    /* Schema version. We only support exactly the compiled-in version for
     * now; older fw declines newer schemas instead of misinterpreting.   */
    if (ch->schema_version != MOTOR_CONFIG_SCHEMA_VERSION) {
        s_latched_ack_flags = MOTOR_FLAG_ACK_NACK | MOTOR_FLAG_NACK_VER;
        g_cmd_nack++;
        return;
    }

    switch (ch->cmd) {

    case MOTOR_CMD_PING:
        s_latched_ack_flags = MOTOR_FLAG_ACK_OK;
        g_cmd_ok++;
        return;

    case MOTOR_CMD_SET_CONFIG: {
        const config_payload_t *p =
            (const config_payload_t *)(buf + sizeof(cmd_header_t));

        /* Idempotency: if we've already applied this exact cmd_seq, just
         * re-affirm the ACK (handles Pi-side retries when its ACK was
         * missed in transit). */
        if (s_have_last_applied && ch->cmd_seq == s_last_applied_seq) {
            s_latched_ack_flags = MOTOR_FLAG_ACK_OK;
            return;
        }

        /* Range check EVERY field before we touch anything.
         * sample_rate_hz and imu_rate_hz allow 0 as a "leave alone" sentinel;
         * non-zero values must fall in the valid band.                      */
        int bad_sample = (p->sample_rate_hz != 0u &&
                          (p->sample_rate_hz < 100u || p->sample_rate_hz > 100000u));
        int bad_imu    = (p->imu_rate_hz != 0u &&
                          (p->imu_rate_hz < 10u || p->imu_rate_hz > 1000u));
        /* `!=` not `>`. Only ADC is supported, and the old `>` let SOURCE_SYNTH
         * (0) through this gate -- it is not greater than ADC (1) -- to be
         * caught by a second check further down, AFTER block_rows, sample_rate,
         * imu_rate and run_state had already been pushed into the hardware. The
         * command was then NACK'd, leaving the board reconfigured by a request
         * it had just told the Pi it rejected. Catching it here restores what
         * the comment below always claimed: validate everything, then apply. */
        if (p->block_rows == 0u || p->block_rows > MOTOR_MAX_ROWS_PER_BLOCK ||
            p->source != MOTOR_SOURCE_ADC ||
            p->run_state > MOTOR_RUN_RUN ||
            bad_sample || bad_imu) {
            s_latched_ack_flags = MOTOR_FLAG_ACK_NACK | MOTOR_FLAG_NACK_RANGE;
            g_cmd_nack++;
            return;
        }

        /* Per-field diff vs the currently-applied config. Only touch HAL for
         * fields that actually changed. This is what makes a "push defaults at
         * boot" SET_CONFIG cost zero -- no HAL_TIM_Base_Init from inside the
         * TIM2 ISR, no pattern rebuild, just an ACK.                         */
        uint8_t any_change = 0;

        if (p->block_rows != s_active_config.block_rows) {
            motor_send_set_block_rows(p->block_rows);
            motor_acquire_set_block_rows(p->block_rows);
            any_change = 1;
        }
        /* synth_cycles is _reserved0 in schema v2; ignore whatever the Pi
         * happened to send.                                                 */
        if (p->sample_rate_hz != 0u &&
            p->sample_rate_hz != s_active_config.sample_rate_hz) {
            motor_acquire_set_sample_rate(p->sample_rate_hz);
            any_change = 1;
        }
        if (p->imu_rate_hz != 0u &&
            p->imu_rate_hz != s_active_config.imu_rate_hz) {
            motor_acquire_set_imu_rate(p->imu_rate_hz);
            any_change = 1;
        }
        if (p->run_state != s_active_config.run_state) {
            motor_acquire_set_run_state((uint8_t)p->run_state);
            any_change = 1;
        }
        /* (source is validated up front with the other fields, before anything
         * is applied -- see the range check above.) */

        /* Commit to the active-config record AFTER successful apply, so any
         * future diff is against what we actually programmed.                */
        s_active_config = *p;
        if (p->sample_rate_hz == 0u) {
            /* "leave alone" sentinel -- preserve for next diff */
            s_active_config.sample_rate_hz = 0u;
        }

        s_last_applied_seq  = ch->cmd_seq;
        s_have_last_applied = 1;
        s_latched_ack_flags = MOTOR_FLAG_ACK_OK;
        s_config_applied_latch = 1;     /* one-shot bit in NEXT outbound frame */
        g_cmd_ok++;
        (void)any_change;
        return;
    }

    default:
        s_latched_ack_flags = MOTOR_FLAG_ACK_NACK | MOTOR_FLAG_NACK_CMD;
        g_cmd_nack++;
        return;
    }
}

