Mintharah/SPI-Stm32-QNX/Stm32-SPI/src/motor_send.c
/* ---- stalled-transfer recovery ------------------------------------------
 *
 * Once arm_tx() succeeds the state machine has exactly one way out: the
 * master finishes clocking MOTOR_MAX_FRAME_BYTES, TxRxCplt fires, PB0 drops
 * and the next frame is armed. If those clocks never arrive, nothing here
 * ever runs again:
 *
 *   - TxRxCplt cannot fire, because the DMA never completes.
 *   - ErrorCallback cannot fire either -- an abandoned transfer produces no
 *     OVR/FRE, it just sits there.
 *   - s_tx_idx stays >= 0 forever, so every later motor_on_block_ready takes
 *     the queue path, fills the pool and returns without arming.
 *   - PB0 stays HIGH forever.
 *
 * That is a permanent deadlock, and it survives anything done on the Pi side:
 * the master sees data-ready asserted, reads a frame the slave is not
 * driving, gets garbage, and repeats. Only a reset of THIS board clears it,
 * which is why it looks like a Pi problem and is not one.
 *
 * The master abandoning a transfer mid-frame is routine, not exotic -- the
 * producer being restarted, spi-dwc being bounced (which motor_controller
 * does by itself on an SPI-tier config reload), or the Pi rebooting all leave
 * the slave part-way through a frame.
 *
 * So: if a transfer has been in flight for TX_STALL_BLOCKS block periods,
 * tear it down and re-arm on the next block. At the default 20 kHz / 200 rows
 * a block is 10 ms, so the budget below is ~1 s -- far longer than any real
 * transfer (a 4828-byte frame is ~5 ms at 8 MHz, and tens of ms even on a
 * badly misconfigured bus), and short enough that the link recovers on its
 * own a second after the master comes back.
 */
#ifndef TX_STALL_BLOCKS
#define TX_STALL_BLOCKS  100u
#endif

volatile uint32_t g_tx_stall = 0;      /* stalled transfers recovered */

static uint32_t s_inflight_blocks = 0; /* blocks elapsed with a tx in flight */

static void tx_recover(void)
{
    g_tx_stall++;

    /* Drop data-ready first: the master must stop starting new reads against
     * a slave that is about to be torn down. */
    HAL_GPIO_WritePin(DR_PORT, DR_PIN, GPIO_PIN_RESET);

    HAL_SPI_DMAStop(&s_hspi2);

    /* Re-arming while the master still holds CS asserted would splice us into
     * the middle of its current frame. Wait for the bus to go idle, bounded so
     * a CS stuck low cannot hang the ISR this runs from. */
    uint32_t cs_wait = 50000u;
    while ((GPIOB->IDR & GPIO_PIN_12) == 0u && --cs_wait) {
        __NOP();
    }

    /* An aborted transfer leaves OVR/FRE latched, and DMAStop does not clear
     * them -- same trap arm_tx() documents on its retry path. Left set, the
     * error interrupt re-fires the instant we re-enable. */
    if (s_hspi2.Instance->SR & SPI_SR_OVR) {
        volatile uint32_t tmp = s_hspi2.Instance->DR;
        tmp = s_hspi2.Instance->SR;
        (void)tmp;
    }
    if (s_hspi2.Instance->SR & SPI_SR_FRE) {
        s_hspi2.Instance->CR1 &= ~SPI_CR1_SPE;
        s_hspi2.Instance->CR1 |=  SPI_CR1_SPE;
    }

    if (s_tx_idx >= 0) s_slot_state[s_tx_idx] = SLOT_EMPTY;
    s_tx_idx          = -1;
    s_inflight_blocks = 0;
    /* Queued frames were never touched by the aborted transfer; leave them in
     * s_ready_q. The next motor_on_block_ready re-arms the oldest of them, so
     * a stalled link recovers without losing the blocks that were waiting.  */
}

/* ---- the producer hook --------------------------------------------------- */
void motor_on_block_ready(const motor_row_t *rows, uint16_t n_rows)
{
    g_obr++;

    /* Watchdog the in-flight transfer before anything else, so a stalled one
     * is cleared in time for this block to be armed normally below. */
    if (s_tx_idx >= 0) {
        if (++s_inflight_blocks >= TX_STALL_BLOCKS)
            tx_recover();
    } else {
        s_inflight_blocks = 0;
    }

    /* Assemble the CURRENT block using the CURRENT config into a free pool
     * slot, then queue it. If every slot is already occupied (one in flight +
     * the backlog) the block is dropped -- the only case where a produced
     * block is ever lost, and ~40 ms of backlog it cannot realistically
     * sustain. Then process any pending command, so a SET_CONFIG only takes
     * effect for the next block. This keeps the in-flight DMA and the frame
     * header consistent.                                                  */
    int free_slot = -1;
    for (unsigned i = 0; i < TX_POOL_DEPTH; ++i) {
        if (s_slot_state[i] == SLOT_EMPTY) { free_slot = i; break; }
    }

    if (free_slot < 0) {
        s_skipped++;                        /* pool full: drop the new block */
        s_block_dropped_pending = 1;
    } else {
        assemble_frame(s_frame[free_slot], rows, n_rows);
        s_slot_state[free_slot] = SLOT_READY;
        s_ready_q[(s_ready_head + s_ready_cnt) % TX_POOL_DEPTH] = free_slot;
        s_ready_cnt++;
    }

    /* If the link is idle, transmit the oldest queued block immediately. */
    if (s_tx_idx < 0 && s_ready_cnt > 0)
        arm_next_slot();

    if (s_cmd_pending) process_pending_cmd();
}

/* ---- SPI ISR callbacks --------------------------------------------------- */
void HAL_SPI_TxRxCpltCallback(SPI_HandleTypeDef *h)
{
    if (h->Instance != SPI2) return;


    HAL_GPIO_WritePin(DR_PORT, DR_PIN, GPIO_PIN_RESET);
    s_sent++;
    g_sent++;

    /* A frame completed, so whatever is armed next starts its stall budget
     * from zero. Without this the counter carries over between transfers and
     * eventually trips tx_recover() on a perfectly healthy link. */
    s_inflight_blocks = 0;

    /* Sniff the rx for a command frame. Cheap: just compare 4 bytes. The
     * full validation (CRC, ranges) happens at the next block boundary in
     * process_pending_cmd. */
    uint32_t mag;
    memcpy(&mag, s_rx_dummy, sizeof mag);
    if (mag == MOTOR_CMD_MAGIC && !s_cmd_pending) {
        memcpy(s_pending_cmd, s_rx_dummy, MOTOR_CMD_FRAME_BYTES);
        s_cmd_pending = 1;
        g_cmd_seen++;
    }

    int just = s_tx_idx;

    /* The just-completed transfer's slot is free for reuse. */
    if (just >= 0) s_slot_state[just] = SLOT_EMPTY;

    /* Keep the DMAStop. It looks wrong and measures right.
     *
     * This callback is the transfer completing, so stopping the DMA here is
     * redundant on paper, and it manufactures errors: 80 HAL_SPI_ERROR_DMA per
     * second against 99 completed transfers, four in five. Removing it cleans
     * that up almost entirely -- spi_err 84/s -> 6/s, err_dma 81/s -> 3/s.
     *
     * It also makes the link worse. Matched 60-second windows, everything else
     * identical, measured at the Pi where it counts:
     *
     *     with DMAStop:     ok 95/s   drops 0/s   magic  5/s
     *     without:          ok 89/s   drops 0/s   magic 12/s
     *
     * So the aborts are benign bookkeeping and the stop is doing something real
     * -- resynchronising the peripheral between frames -- that the error
     * counter gives no credit for. Judge this by ok/magic at the Pi, never by
     * g_spi_err, which points the opposite way.
     */
    HAL_SPI_DMAStop(&s_hspi2);

    /* Re-arm the oldest queued block immediately when one is waiting.
     *
     * Not re-arming was tried, to give the Pi a clean low->high edge per frame
     * instead of a data-ready line that barely dips between transfers. It did
     * cut bad frames (10/s -> 3/s) but cost more than it bought, because the
     * pending block is then discarded rather than sent:
     *
     *     re-arm:      ok 91/s   drops  0/s   magic 10/s
     *     no re-arm:   ok 85/s   drops 11/s   magic  3/s
     *
     * Six good blocks a second is a worse trade than seven bad reads, so the
     * re-arm stays. Recorded here so it is not re-attempted blind. */
    if (s_ready_cnt > 0)
        arm_next_slot();
    else
        s_tx_idx = -1;

