Mintharah/SPI-Stm32-QNX/Stm32-SPI/src/motor_send.c
}

/* Which error, specifically. g_spi_err alone says ~41/s are happening but not
 * what they are, and the two likely causes want opposite fixes:
 *   OVR -- the master clocked us while no DMA was armed (a read that landed in
 *          the gap between TxRxCplt and the next arm_tx, or on a stale-high
 *          data-ready). Timing problem.
 *   FRE -- NSS moved mid-frame. With SPI_NSS_HARD_INPUT that means the master
 *          deasserted chip-select part way through. Wiring or driver problem.
 * Diagnostic only; no behaviour change. */
volatile uint32_t g_err_ovr = 0, g_err_fre = 0, g_err_modf = 0,
                  g_err_dma = 0, g_err_other = 0;
volatile uint32_t g_err_idle    = 0;  /* arrived with nothing in flight       */
volatile uint32_t g_err_live    = 0;  /* arrived with a transfer in flight    */


void HAL_SPI_ErrorCallback(SPI_HandleTypeDef *h)
{
    if (h->Instance != SPI2) return;
    g_spi_err++;

    {
        uint32_t e = h->ErrorCode;
        if (e & HAL_SPI_ERROR_OVR)  g_err_ovr++;
        if (e & HAL_SPI_ERROR_FRE)  g_err_fre++;
        if (e & HAL_SPI_ERROR_MODF) g_err_modf++;
        if (e & HAL_SPI_ERROR_DMA)  g_err_dma++;
        if (!(e & (HAL_SPI_ERROR_OVR | HAL_SPI_ERROR_FRE |
                   HAL_SPI_ERROR_MODF | HAL_SPI_ERROR_DMA))) g_err_other++;
    }

    /* Ignore an error that arrives while a transfer is armed and running.
     *
     * HAL_SPI_DMAStop() in the completion path aborts streams that are still
     * retiring, and that abort surfaces here as HAL_SPI_ERROR_DMA -- about 80
     * times a second, four transfers in five. By the time it lands, the
     * completion callback has usually already armed the NEXT frame and raised
     * data-ready. Tearing down at that point kills a perfectly healthy
     * transfer, and if the master has already sampled data-ready high it then
     * clocks into a slave with no DMA armed. That is the OVR in the counters
     * and the bad magic the Pi reports: the error handler was causing the very
     * fault it exists to recover from.
     *
     * If SPI is BUSY_TX_RX with a live s_tx_idx then the armed transfer is
     * fine and this error belongs to the previous one. Drop it.
     *
     * It cannot mask a genuine stall: a transfer that really is wedged stops
     * completing, and the TX_STALL_BLOCKS watchdog in motor_on_block_ready
* tears it down and re-arms within about a second. */
    /* Nothing in flight, so there is nothing to recover -- and acting anyway
     * does harm. The teardown below clears the in-flight slot, so a stale
     * error landing between transfers discards nothing (queued blocks are in
     * their own slots), but it does drop data-ready after the completion path
     * has raised it. If the master has already sampled that line high it then
     * clocks into a slave with no DMA armed, which is the OVR in the counters
     * and the bad magic at the Pi.
     *
     * These are counted separately so the split is visible rather than
     * assumed: g_err_idle vs g_err_live. */
    if (s_tx_idx < 0) {
        g_err_idle++;
        return;
    }
    g_err_live++;

    HAL_GPIO_WritePin(DR_PORT, DR_PIN, GPIO_PIN_RESET);

    /* Stop DMA but keep the peripheral enabled so the master can finish
     * the current frame without getting a FRE.  Do NOT re-arm here:
     * re-arming the same buffer creates a duplicate frame (same seq)
     * which wastes the controller's time and causes the next valid frame
     * to be skipped, inflating the drop count.  Instead, let the
     * completion callback or the next capture-completion handle re-arm
     * naturally via the normal s_tx_idx / s_ready_q state machine.       */
    HAL_SPI_DMAStop(&s_hspi2);
    if (s_tx_idx >= 0) s_slot_state[s_tx_idx] = SLOT_EMPTY;
    s_tx_idx = -1;
    s_inflight_blocks = 0;   /* transfer is over; next one starts fresh */

    /* Queued blocks survive an error. The old single-slot design had to drop
     * the pending block because re-arming it later, after a NEWER block had
     * been assembled into the same buffer, sent an old seq out of order. The
     * pool keeps each queued frame in its own slot, and the FIFO arms them in
     * seq order, so "B after C with a lower seq" is impossible -- the oldest
     * queued frame is always armed first. Only the frame on the failed
     * transfer itself is lost. */
}

/* ---- init ---------------------------------------------------------------- */
static void gpio_init(void)
{
    __HAL_RCC_GPIOB_CLK_ENABLE();

    GPIO_InitTypeDef g = {0};
    g.Pin       = GPIO_PIN_12 | GPIO_PIN_13 | GPIO_PIN_14 | GPIO_PIN_15;
    g.Mode      = GPIO_MODE_AF_PP;
    g.Pull      = GPIO_NOPULL;
    g.Speed     = GPIO_SPEED_FREQ_VERY_HIGH;
    g.Alternate = GPIO_AF5_SPI2;
    HAL_GPIO_Init(GPIOB, &g);

    GPIO_InitTypeDef d = {0};
    d.Pin   = DR_PIN;
    d.Mode  = GPIO_MODE_OUTPUT_PP;
    d.Pull  = GPIO_NOPULL;
    d.Speed = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(DR_PORT, &d);
    HAL_GPIO_WritePin(DR_PORT, DR_PIN, GPIO_PIN_RESET);
}

static void dma_init(void)
{
    __HAL_RCC_DMA1_CLK_ENABLE();

    s_hdma_tx.Instance                 = DMA1_Stream4;
    s_hdma_tx.Init.Channel             = DMA_CHANNEL_0;
    s_hdma_tx.Init.Direction           = DMA_MEMORY_TO_PERIPH;
    s_hdma_tx.Init.PeriphInc           = DMA_PINC_DISABLE;
    s_hdma_tx.Init.MemInc              = DMA_MINC_ENABLE;
    s_hdma_tx.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    s_hdma_tx.Init.MemDataAlignment    = DMA_MDATAALIGN_BYTE;
    s_hdma_tx.Init.Mode                = DMA_NORMAL;
    s_hdma_tx.Init.Priority            = DMA_PRIORITY_HIGH;
    s_hdma_tx.Init.FIFOMode            = DMA_FIFOMODE_DISABLE;
    if (HAL_DMA_Init(&s_hdma_tx) != HAL_OK) Error_Handler();
    __HAL_LINKDMA(&s_hspi2, hdmatx, s_hdma_tx);

    s_hdma_rx.Instance                 = DMA1_Stream3;
    s_hdma_rx.Init.Channel             = DMA_CHANNEL_0;
    s_hdma_rx.Init.Direction           = DMA_PERIPH_TO_MEMORY;
    s_hdma_rx.Init.PeriphInc           = DMA_PINC_DISABLE;
    /* Was DMA_MINC_DISABLE -- but we now want to CAPTURE the Pi's tx into
     * s_rx_dummy so we can sniff command frames. Enable memory increment. */
    s_hdma_rx.Init.MemInc              = DMA_MINC_ENABLE;
    s_hdma_rx.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    s_hdma_rx.Init.MemDataAlignment    = DMA_MDATAALIGN_BYTE;
    s_hdma_rx.Init.Mode                = DMA_NORMAL;
    s_hdma_rx.Init.Priority            = DMA_PRIORITY_HIGH;
    s_hdma_rx.Init.FIFOMode            = DMA_FIFOMODE_DISABLE;
    if (HAL_DMA_Init(&s_hdma_rx) != HAL_OK) Error_Handler();
    __HAL_LINKDMA(&s_hspi2, hdmarx, s_hdma_rx);

